<template>
  <div class="agreement">
    <div class="agreement-title">
      <div class="pop-close"
        @click="close">
      </div>
      用戶條款
    </div>
    <div class="agreement-content-wrapper">
      <img v-lazy="imgUrl">
      <div class="agreement-content">
        <ul class="content-ul">本協議由用戶與深圳市遞四方速遞有限公司（下稱本公司）共同締結，本協議中協議雙方合稱協議方。本協議中“4PX遞四方”指由本公司運營的網路交易平臺，包括但不限於hk.4px.com。</ul>
        <p class="content-theme">一、總則</p>
        <ul class="content-ul">
          <li>用戶在使用4PX遞四方提供的各項服務之前，應仔細閱讀本服務協議，如用戶不同意本服務協議，可以主動取消4PX遞四方提供的服務；用戶在使用4PX遞四方提供的各項服務的同時，承諾接受並遵守各項相關規則的規定。4PX遞四方有權根據需要不時地制定、修改本協議或各類規則，如本協議有任何變更，4PX遞四方將在網站上刊載公告，通知用戶。如用戶不同意相關變更，必須停止使用“本服務”。經修訂的協議一經在4PX遞四方公佈後，立即自動生效。各類規則會在發佈後生效，亦成為本協議的一部分。登錄或繼續使用“本服務”將表示用戶接受經修訂的協議。除另行明確聲明外，任何使“本服務”範圍擴大或功能增強的新內容均受本協議約束。</li>
          <li>用戶在簽署本服務協議前，務必認真閱讀全部服務協議內容，如有任何疑問，可向4PX遞四方諮詢。用戶點擊協議正文下方的“確認”按鈕並按照4PX遞四方註冊程式成功註冊為用戶，視為與4PX遞四方簽署了本服務協議，並同意接受協議約定的內容，本服務協議即在協議方之間產生法律效力。</li>
        </ul>
        <p class="content-theme">二、註冊資訊和隱私保護</p>
        <ul class="content-ul">
          <li>（1）用戶不得將會員資格出借、轉讓、買賣、抵押等；</li>
          <li>（2）用戶不應將其帳號、密碼轉讓或出借給他人使用，由於用戶自己對帳號的保管不當、不安全操作或使用所造成的一切糾紛和後果，由用戶自行承擔，4PX遞四方不承擔任何責任。如用戶發現其帳號遭他人非法盜用、使用或發生其他危及帳戶安全的情形，應立即書面通知遞四方，要求暫停或終止相關服務，4PX遞四方將在合理時間內進行處理，但對在採取行動前已經產生的後果（包括但不限於用戶的任何損失）不承擔任何責任。</li>
          <li>（3）用戶應提供及時、詳盡及準確的個人資料，並不斷更新註冊資料，符合及時、詳盡、準確的要求。所有原始鍵入的資料將引用為註冊資料。如果因註冊資訊不真實而引起的問題，對問題發生所帶來的後果，4PX遞四方將不負任何責任；</li>
          <li>（4）4PX遞四方遵循隱私政策保護個人資訊，不向第三方提供具有可識別性的個人資訊。</li>
          <li>（5）4PX遞四方保留核實用戶真實性的權力，對於拒絕提供有效身份證明，購物憑據的用戶，4PX遞四方有權關閉用戶帳戶，拒絕提供服務；</li>
        </ul>
        <p class="content-theme">
          三、責任範圍和責任限制
        </p>
        <ul class="content-ul">
          <li>（1）非購買保險的托運貨物發生丟失、損毀、短少時，按照本公司官方網站（hk.4px.com）公佈的理賠規則賠付；購買保險的，按照本公司官方網站公佈的保險賠付規則賠付。本公司不承擔任何間接、附帶、特殊或衍生的損失（包括但不限於收入或利潤損失）所產生的賠償責任。</li>
          <li>（2）本公司不會就下列原因造成的托運貨物遺失、損毀、延遲送達、誤送、未送達承擔任何責任，亦不對因下述任一情況而導致用戶的任何損害賠償承擔責任，包括但不限於利潤、商譽、使用、數據等方面的損失或其他無形損失的損害賠償，亦不採取任何運費調整、退款或任何補償行為：</li>
          <li>（3）因用戶、托運貨物所有人、承運人不履行責任或疏忽造成的；</li>
          <li>（4）因托運貨物的本質或瑕疵、特性或固有缺陷，如有明顯破損等；</li>
          <li>（5）用戶違反本公司所簽發的運單、本條款、服務指南、或其他協議等，包括但不限於貨物申報不實，寄運貨件的包裝、安全保障、標誌或地址書寫不當或不完整；</li>
          <li>（6）發生空難事故、公敵入侵、政府當局、法律許可權、海關或檢疫所官員的行為或疏忽、暴動、罷工或其他地區性爭執、民眾騷亂、戰爭或天氣所帶來的危險、或由非本公司所能控制事項所致的全國性或區域性空中或地面交通系統中斷或通訊系統干擾或故障。在此情況下，本公司仍會盡合理的努力，儘快運送至目的地並完成送件。但我們沒有義務在出現此類情況時向用戶發出通知；</li>
          <li>（7）本公司遵循用戶或其他寄、收件人的口頭或書面送件指示行為導致；</li>
          <li>（8）如果包裹在送達時無破損且基本完整、收件人未提出異議併發出書面破損記錄，寄件人包裝並封口的包裹內發生遺失或損毀；</li>
          <li>（9）因清關手續或其他主管機關規定手續所致的延誤；</li>
          <li>（10）因用戶沒有及時確認關稅及稅金支付所致的延誤；</li>
          <li>（11）磁帶、檔或其他存儲媒體中數據的消除、或曝光底片中照相影像或音帶地消除；</li>
          <li>（12）外包裝完好，內件破損的包裹；</li>
          <li>（13）易碎品的破損及損壞，包括但不限於玻璃陶瓷材料及其製品，樂器，電子設備元件，照相器材等；除要求加固增值服務後依然導致破損及損害情況外；</li>
          <li>（14）發件人或者購物網站未能提供能夠支持多次轉運需要的包裝而造成的毀損；</li>
          <li>（15）提供錯誤、不完整、不正確或遺漏的地址資訊，無法聯繫收件人，造成的重複配送所產生的費用及相關的後果，我們將不承擔責任；</li>
          <li>（16）貨物入庫超過90天未提交運單發貨，系統自動移除包裹並做棄貨處理。</li>
        </ul>
        <p class="content-theme">
          四、索賠
        </p>
        <ul class="content-ul">
          <li>對於托運貨物或部分托運貨物損毀、遺失（包括延誤引起的貨物腐爛或損壞）的索賠，寄件人必須在托運貨物送達後 30 日向本司提出書面索賠申請,包含理賠申請表，購物發票或者證明，簽收憑據。對於未能送件或錯誤送件的索賠，寄件人應自接受托運貨物後30日內向本公司提出書面申請，寄件人在超出索賠日期後提出索賠申請將不被受理。</li>
          <li>收件人受領托運貨物的收據上若無受領物品毀損的書面通知，應屬托運貨物是以良好狀況送件的初步證據。對於異常包裹，收件人在簽收的時候務必在簽收單上注明，並且讓快遞員簽字。貨物到達指定地點，除用戶或托運人特別聲明由指定收貨人簽收外，貨物到達地的門衛、同事、家人等代收人簽收將一律視為本人簽收，對於正常簽收的包裹，本公司將不接受理賠申請。</li>
        </ul>
        <p class="content-theme">
          五、服務約定
        </p>
        <ul class="content-ul">
          <li>（1）托運人不得托運或在所托運貨物中夾帶國家禁止運輸的物品；因違背此約定造成承運人的一切損失托運人須雙倍賠償；</li>
          <li>（2）托運人或收貨人不得無故拒付任何服務費用。約定到達目的地付款的貨物，托運人承擔支付與托運物品有關費用的連帶責任。托運人或收貨人無故不支付費用的，承運人可以對承運貨物行使處置權、留置權及其他補救性權利，由此而產生的後果由托運人或收貨人承擔；</li>
          <li>（3）承運人從貨物收運時起到交付時止承擔安全運輸責任，在此期間若發生貨物損壞、短缺、滅失、污染，承運人負賠償責任；</li>
          <li>（4）凡因履行本協議或與本協議有關的爭議，當事人可以通過協商或調解解決，協商或調解不成，任何一方均應向本公司所在地人民法院提起訴訟；</li>
          <li>（5）托運人務必如實地申報貨物價值，申報價值需與收/發貨人雙方的交易價格相同。如因托運人瞞報、少報貨值導致被海關退關或罰款，相關責任及費用概由托運人承擔；</li>
          <li>（6）貨運價格依承運人公佈價格確定。該價格不包含接送貨費、稅金、政府規費以及由於托運人或收貨人的原因而增加的其他費用。</li>
        </ul>
        <p class="content-theme">
          六、禁止托運的貨物
        </p>
        <ul class="content-ul">
          <li>（1）現金及支票、匯票、證券以及其他有價證券類；</li>
          <li>（2）信用卡、現金卡等卡類；</li>
          <li>（3）金融機關的存摺以及現金提款卡；</li>
          <li>（4）包裹上的送達地不易識別；</li>
          <li>（5）活的動植物、死的動物或剝制的動物（即標本）；</li>
          <li>（6）人體或人體的一部分、遺體、遺骨、牌位；</li>
          <li>（7）興奮劑、大麻、麻藥、作用於中樞神經影響精神狀態的藥物以及其他違禁藥物；</li>
          <li>（8）槍炮、刀劍、武器、兵器、火藥類、爆炸物、有毒物、有毒化學物品；</li>
          <li>（9）醫藥品、醫療器械；</li>
          <li>（10）兒童色情畫、成人色情錄影帶以及其他淫穢物品；</li>
          <li>（11）其運送、進出口受包括經由國在內的進出口國、州、地方自治體的法令禁止或限制的物品；航空、運輸公司的運輸協議中不允許承運的其他物品；</li>
          <li>（12）不適合進行托運的其他物品。</li>
          <li>更多禁運品資訊，請參考禁運品列表。</li>
        </ul>
        <p class="content-theme">
          七、禁止行為
        </p>
        <ul class="content-ul">
          <li>用戶在使用本服務中，不得有屬於或有可能屬於以下任何一項的行為</li>
          <li>（1）以不正當的目的使用本服務的行為；</li>
          <li>（2）侵害本公司以及第三方的商標權、著作權、外觀專利權、發明專利權等知識產權以及肖像權、廣告宣傳權以及其他權利；</li>
          <li>（3）涉及欺詐等犯罪的行為；</li>
          <li>（4）偽裝第三方使用本服務的行為；</li>
          <li>（5）不正當地使用本公司以及第三方的設備，或阻礙運營的行為；</li>
          <li>（6）違反法令、本協議或個別協議，以及違反公共秩序和社會道德的行為；</li>
          <li>（7）妨害本服務運營的行為；</li>
          <li>（8）公司認為不符合規定的其他行為。</li>
          <li>用戶違反上述約定，4PX遞四方可視情節輕重給予暫停服務或停止服務；用戶行為涉及觸犯法律，將移交相關部門處理；給本公司造成損失的，本公司將要求用戶進行賠償。</li>
        </ul>
        <p class="content-theme">
          八、其他
        </p>
        <ul class="content-ul">
          <li>（1）本協議的執行、解釋及爭議的解決均應適用中華人民共和國法律；</li>
          <li>（2）如雙方就本協議內容或其執行發生任何爭議，雙方應儘量友好協商解決；協商不成時，任何一方均可向本公司所在地的人民法院提起訴訟；</li>
          <li>（3）本公司未行使或執行本服務協議任何權利或規定，不構成對前述權利或權利之放棄。如本協議中的任何條款無論因何種原因完全或部分無效或不具有執行力，本協議的其餘條款仍有效並且有約束力。</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'agreement',
  data () {
    return {
      imgUrl: require('../../assets/image/user-banner1.jpg')
    }
  },
  methods: {
    close () {
      this.$emit('close')
    }
  }
}
</script>

<style scoped lang="less">
  @import "../../assets/less/variable.less";
  .agreement {
    height: 100%;
    width: 100%;
    overflow: hidden;
    .agreement-title {
      background-color: #fff;
      border-bottom: 2px solid @primary;
      font-size: 0.34rem;
      color: #333;
      line-height: 0.84rem;
      box-sizing: border-box;
      text-align: center;
      height: 0.88rem;
      overflow: hidden;
      .pop-close {
        width: 0.88rem;
        height: 0.88rem;
        background: url(../../assets/image/close.png) center no-repeat;
        background-size: 0.4rem;
        position: absolute;
        top: 0;
        left: 0;
      }
    }
    .agreement-content-wrapper {
      height: calc(~"100% - .88rem");
      overflow-y: scroll;
      img {
        width: 100%;
        max-height: 2.8rem;
      }
    }
    .agreement-content {
      background: #fff;
      padding: 0.2rem 0.3rem;
      .content-theme {
        font-size: 0.32rem;
        margin: 0.16rem 0;
        color: #333;
      }
      .content-ul {
        list-style: none;
        font-size: 0.28rem;
        color: #333;
        margin: 0 0 0.08rem 0.16rem;
        line-height: 0.44rem;
        li {
          font-size: 0.28rem;
          color: #333;
          // margin: 0 0 0.08rem 0.16rem;
          line-height: 0.44rem;
        }
      }
      .content-sub {
        font-size: 0.28rem;
        color: #333;
        margin: 0 0 0.08rem 0.16rem;
        line-height: 0.44rem;
      }
      .content-sub-sub {
        font-size: 0.28rem;
        color: #333;
        margin: 0 0 0.08rem 0.16rem;
        line-height: 0.44rem;
      }
    }
  }
</style>
