<template>
  <div class="agreement">
    <div class="agreement-title">
      <div class="pop-close"
        @click="close">
      </div>
      遞四方注册服務協定
    </div>
    <div class="agreement-content-wrapper">
      <div class="agreement-content">
        <p>歡迎您使用遞四方的物流服務！</p>
        <p>為順暢使用遞四方的物流服務，您應當閱讀並遵守《遞四方注册服務協議》（以下簡稱“本協定”）。請您務必謹慎閱讀、充分理解各條款內容，特別是免除或者限制責任的條款、管轄與法律適用條款，以及開通或使用某項服務的單獨協定。限制、免責條款可能以黑體加粗或加底線的形式提示，便於重點關注。除非您已閱讀並接受本協定所有條款，否則您無權使用遞四方提供的服務。您使用遞四方的服務即視為您已閱讀並同意上述協定的約束。</p>
        <h3>一、協定的範圍</h3>
        <p>1.1 本協定是您與遞四方之間關於用戶使用遞四方相關服務所訂立的協定。“遞四方”指深圳市遞四方速遞有限公司。“用戶”指使用遞四方相關服務的使用人，在本協定中更多地稱為“您”。</p>
        <p>1.2 本網站提供的產品品牌均具有獨立的協定，詳細項請參照各產品的具體協定。</p>
        <h3>二、帳號與密碼安全</h3>
        <p>您在使用本服務時需要注册一個帳號，請妥善保管您的帳號和密碼。當您使用完畢後，應安全退出。因您保管不善可能導致遭受盜號或密碼失竊，責任由您自行承擔。</p>
        <h3>三、使用本服務的管道</h3>
        <p>3.1 除非與遞四方另有約定，否則您同意本服務僅為商業性質的使用。</p>
        <p>3.2 您應當通過遞四方提供或認可的管道使用本服務。依本協定條款所取得的權利不可轉讓。</p>
        <p>3.3 不得使用未經遞四方授權的挿件、外掛或協力廠商工具對本協定項下的服務進行干擾、破壞、修改或施加其他影響。</p>
        <h3>四、按現狀提供服務</h3>
        <p>您理解並同意，遞四方的服務是按照現有科技和條件所能達到的現狀提供的。遞四方會盡最大努力向您提供服務，確保服務的連貫性和安全性；但遞四方不能隨時預見和防範法律、科技以及其他風險，包括但不限於不可抗力、病毒、木馬、駭客攻擊、系統不穩定、政府行為等原因可能導致的服務中斷、資料丟失以及其他的損失和風險。</p>
        <h3>五、自備設備</h3>
        <p>5.1 您應當理解，您使用遞四方的服務需自行準備與相關服務有關的終端設備（如電腦、數據機等裝置），並承擔所需的費用（如電話費、上網費等費用）。</p>
        <p>5.2 您理解並同意，使用本服務時會耗用您的終端設備和頻寬等資源。</p>
        <h3>六、基於網站提供服務</h3>
        <p>6.1 為了改善用戶體驗、保證服務和產品的質量和安全性，遞四方可能會對服務進行維護更新。在維護之前會發出公告，在維護期間可能會造成服務的不穩定，請多關注公告。</p>
        <p>6.2 不允許惡意攻擊遞四方服務。</p>
        <p>6.3 如發現服務漏洞，請及時聯系遞四方，不要在公開場合隨意傳播。</p>
        <h3>七、保密條款</h3>
        <p>7.1 用戶應依照本站的注册提示提供真實、正確、最新及完整的資料，並隨時更新登記資料，確保其為真實、正確、最新及完整的資料。若用戶提供任何錯誤、不實、過時或不完整或具誤導性的資料，或者遞四方有理由懷疑前述資料為錯誤、不實、過時或不完整或具誤導性的，遞四方有權暫停或終止該用戶的帳號，並拒絕該用戶於現在和未來使用遞四方所提供服務之全部或任何部分。</p>
        <p>7.2 一般情况下，您可隨時瀏覽、修改自己提交的資訊，但出於安全性和身份識別的考慮，您可能無法修改註冊時提供的初始注册資訊及其他驗證資訊。</p>
        <p>7.3 遞四方將採取合理的安全手段保護用戶已存儲的相關資訊，除以下情形外，在未得到用戶許可之前，遞四方不會將用戶的任何資訊提供給任何無關的協力廠商：</p>
        <ul>
          <li>●（1）根據國家有關法律規定進行披露</li>
          <li>●（2）根據政府首長部門的強制性要求進行披露</li>
          <li>●（3）根據用戶的明確授權進行披露</li>
          <li>●（4）為維護遞四方合法權益或者社會公共利益進行披露</li>
        </ul>
        <p>7.4 雙方因本協定而知悉對方營業上的機密、情報、計畫、產品等相關資料，均有保密的義務，未經對方書面同意，不得向協力廠商洩漏或做本協定以外的用途，否則應當賠償對方囙此遭受的一切經濟損失。</p>
        <p>7.5 遞四方在合作期給予用戶的獎勵政策或合作方式，用戶都不得向協力廠商洩漏。</p>
        <p>7.6 註冊遞四方默認接受由遞四方官方提供服務資訊和行銷資訊推送，其中行銷資訊可於發送資訊中選擇退訂取消，遞四方遵循隱私政策保護個人資訊，不向第三方提供具有可識別性的個人資訊。</p>
        <p>7.7 雙方的保密義務不因本協定終止而解除。</p>
        <h3>八、責任限制及不承諾擔保</h3>
        <p>8.1 如因不可抗力或其它本站無法控制的原因使本站系統崩潰或無法正常使用導致網上交易無法完成或遺失有關的資訊、記錄等，遞四方不承擔任何責任，但會盡力協助處理善後事宜。</p>
        <p>8.2 因用戶違反有關法律、法規或本站的注册服務條款而令托運的包裹產生損失，用戶同意承擔由此造成的一切損害賠償責任。</p>
        <p>8.3 若用戶提供任何錯誤、不實、過時或不完整或具誤導性的資料，或者遞四方有理由懷疑前述資料為錯誤、不實、過時或不完整或具誤導性的，由此造成的損失由用戶自行承擔，遞四方不承擔任何相關責任。</p>
        <p>8.4 除另有書面說明外，本站所包含或提供給用戶的內容、資料、產品、資訊、服務，均是在“按現狀”和“按現有”的基礎上提供的。</p>
        <p>8.5 除另有書面說明外，遞四方不對本站的運營及本站的內容、產品、資訊、服務作任何明示或默示的聲明或擔保。</p>
        <p>8.6 遞四方不擔保本站或以其他管道通過本站提供給用戶的內容、產品、資訊、資料、服務，其服務器或從本站發出的電子郵件、資訊沒有病毒或其他有害成分。</p>
        <h3>九、協定更新</h3>
        <p>由於國家政策、法律法規的變化或其他原因，遞四方有權不時對本協定及本網站內容進行變更而無需另行通知用戶。如用戶不同意更新後的協定，可以隨時停止使用本站提供的服務，一旦用戶繼續使用本站提供的服務，即視為用戶同意更新後的協定。本協定中的任一條款無效或無法執行，不影響該條款以外的其他條款的效力與執行。</p>
        <h3>十、法律適用</h3>
        <p>本協定適用中華人民共和國法律。</p>
        <h3>十一、爭議的解决管道</h3>
        <p>如因本協定產生任何爭議，雙方應協商解决，如協商不成，任何一方均有權向雙方所在地的人民法院提起訴訟。</p>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'agreement',
  data () {
    return {
    }
  },
  methods: {
    close () {
      this.$emit('close')
    }
  }
}
</script>

<style scoped lang="less">
  @import "../../assets/less/variable.less";
  .agreement {
    height: 100%;
    width: 100%;
    overflow: hidden;
    .agreement-title {
      background-color: #fff;
      border-bottom: 2px solid @primary;
      font-size: 0.34rem;
      color: #333;
      line-height: 0.84rem;
      box-sizing: border-box;
      text-align: center;
      height: 0.88rem;
      overflow: hidden;
      .pop-close {
        width: 0.88rem;
        height: 0.88rem;
        background: url(../../assets/image/close.png) center no-repeat;
        background-size: 0.4rem;
        position: absolute;
        top: 0;
        left: 0;
      }
    }
    .agreement-content-wrapper {
      height: calc(~"100% - .88rem");
      overflow-y: scroll;
      img {
        width: 100%;
      }
    }
    .agreement-content {
      background: #fff;
      padding: 0.2rem 0.3rem;
      .content-theme {
        font-size: 0.32rem;
        margin: 0.16rem 0;
        color: #333;
      }
      .content-ul {
        list-style: none;
        font-size: 0.28rem;
        color: #333;
        margin: 0 0 0.08rem 0.16rem;
        line-height: 0.44rem;
        li {
          font-size: 0.28rem;
          color: #333;
          // margin: 0 0 0.08rem 0.16rem;
          line-height: 0.44rem;
        }
      }
      .content-sub {
        font-size: 0.28rem;
        color: #333;
        margin: 0 0 0.08rem 0.16rem;
        line-height: 0.44rem;
      }
      .content-sub-sub {
        font-size: 0.28rem;
        color: #333;
        margin: 0 0 0.08rem 0.16rem;
        line-height: 0.44rem;
      }
      h1 {
        font-size: 0.4rem;
        text-align: center;
        margin: 0.2rem;
      }
      h3 {
        font-size: 0.3rem;
        margin: 0.2rem 0;
      }
      p {
        font-size: 0.28rem;
        margin-bottom: 0.2rem;
        line-height: 154%;
      }
      ul {
        margin-bottom: 0.2rem;
        li {
          font-size: 0.28rem;
        }
      }
    }
  }
</style>
